ERP.belugaerp/src/InformationRegisters/бг_ДанныеПерегрузок/бг_ДанныеПерегрузок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>бг_ДанныеПерегрузок</name>
  <comment>Регистр служит для отражения перегрузки товаров из одного транспортного средства в другое во время перевозки товара</comment>
  <resources>
    <name>ДатаПерегрузки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ИзмененоПравоСобственности</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ТипДоставки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>3</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Перевозчик</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>МаркаТС</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>РегистрационныйНомерТС</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>РегистрационныйНомерПрицепа</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Заказчик</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Водитель</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПунктПогрузки</name>
    <comment>Адрес перегрузки</comment>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>ПунктРазгрузки</name>
    <comment>Адрес перегрузки</comment>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>Перенаправление</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>Экспедитор</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ТНЕГАИС</name>
    <comment>Ссылка на транспортную накладную ЕГАИС (КТ-2000)</comment>
    <type>
      <types>DocumentRef.ТранспортнаяНакладнаяЕГАИС</types>
    </type>
  </resources>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаФиксации</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>МаршрутныйЛист</name>
    <type>
      <types>DocumentRef.битМаршрутныйЛист</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Объект</name>
    <comment>Учетный документ</comment>
    <type>
      <types>DocumentRef.ПеремещениеТоваров</types>
      <types>DocumentRef.ВозвратТоваровПоставщику</types>
      <types>DocumentRef.ПриобретениеТоваровУслуг</types>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
      <types>DocumentRef.ВозвратТоваровОтКлиента</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерПерегрузки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ERP.belugaerp/src/InformationRegisters/бг_ДанныеПерегрузок/RecordSetModule.bsl
#Область ОбработчикиСобытий
	
Процедура ПередЗаписью(Отказ, Замещение)          
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;  
	УказыватьОтветственного = Не ДополнительныеСвойства.Свойство("НеИзменятьОтветственного");
	ДатаФиксации = ТекущаяДатаСеанса();
	Пользователь = Пользователи.ТекущийПользователь();
	Для каждого Запись Из ЭтотОбъект Цикл
		Если УказыватьОтветственного Тогда
			УказатьОтветственного(Запись, ДатаФиксации, Пользователь);
		КонецЕсли;  
		ЗаменитьПустыеПоля(Запись);
	КонецЦикла;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура УказатьОтветственного(Запись, Период, Ответственный)
	Запись.ДатаФиксации = Период;
	Запись.Ответственный = Ответственный;
КонецПроцедуры

Процедура ЗаменитьПустыеПоля(Запись)
	ПроверитьЗаменить(Запись, "Перевозчик");
	ПроверитьЗаменить(Запись, "МаркаТС");
	ПроверитьЗаменить(Запись, "РегистрационныйНомерПрицепа");
	ПроверитьЗаменить(Запись, "Заказчик");
	ПроверитьЗаменить(Запись, "Экспедитор");
	Если Не Запись.ТипДоставки = "413" Тогда
		ПроверитьЗаменить(Запись, "Водитель");
		ПроверитьЗаменить(Запись, "РегистрационныйНомерТС");
	КонецЕсли;
КонецПроцедуры

Процедура ПроверитьЗаменить(Запись, ИмяПоля)
	Если ПустаяСтрока(Запись[ИмяПоля]) Тогда 
		Запись[ИмяПоля] = "-";
	КонецЕсли;
КонецПроцедуры

#КонецОбласти
